PreProcessing/Modules/BaseFlowGenerator/TunnelToCurvedPlateModule/AirfoilLECase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Generated by generate_cgrid.jl  (221airfoilTopBottom)
//
// C-grid parameters:
//   chord      = 900.0 mm,  AoA = -3.0 deg
//   xi_arch    = 0.025
//   xi_suction = 0.5,  xi_pressure = 0.1
//   H_BL       = 480.0 mm,  H_far = 480.0 mm
//   segments   = 6+2+1+2+4  (suction+archUp+LE+archLo+pressure)
//   total blocks = 28
//   cosine arch = true

scale 0.001;   // vertices in mm → metres

vertices
(
    (    -4.23219420     80.75507609     -1.00000000 )   // 0
    (   -76.17544389     74.51780616     -1.00000000 )   // 1
    (  -147.84290003     65.65014131     -1.00000000 )   // 2
    (  -219.16534649     54.33825088     -1.00000000 )   // 3
    (  -290.01551634     40.37790871     -1.00000000 )   // 4
    (  -360.06307735     22.85535714     -1.00000000 )   // 5
    (  -428.01579169     -1.35258982     -1.00000000 )   // 6
    (  -438.94858446     -7.69985584     -1.00000000 )   // 7
    (  -449.38329064    -23.55118031     -1.00000000 )   // 8
    (  -437.34883229    -38.22494576     -1.00000000 )   // 9
    (  -425.81246053    -43.39465277     -1.00000000 )   // 10
    (  -409.00472571    -48.72052072     -1.00000000 )   // 11
    (  -391.91447672    -53.07014536     -1.00000000 )   // 12
    (  -374.67204474    -56.77304345     -1.00000000 )   // 13
    (  -357.34614880    -60.06542931     -1.00000000 )   // 14
    (   -35.71941744    559.72120723     -1.00000000 )   // 15
    (  -127.76059622    551.73785190     -1.00000000 )   // 16
    (  -213.75300248    541.10346015     -1.00000000 )   // 17
    (  -303.50363656    526.87084534     -1.00000000 )   // 18
    (  -394.13312092    508.94970088     -1.00000000 )   // 19
    (  -495.51353122    483.34767471     -1.00000000 )   // 20
    (  -631.88339802    433.20235387     -1.00000000 )   // 21
    (  -702.20463878    393.66811730     -1.00000000 )   // 22
    (  -928.72546732    -48.67243931     -1.00000000 )   // 23
    (  -657.20836496   -464.91193396     -1.00000000 )   // 24
    (  -583.13989831   -496.87902661     -1.00000000 )   // 25
    (  -533.86933735   -512.19525440     -1.00000000 )   // 26
    (  -504.91583146   -519.57919546     -1.00000000 )   // 27
    (  -468.88159672   -527.43700034     -1.00000000 )   // 28
    (  -443.92003660   -532.19354958     -1.00000000 )   // 29
    (   -67.20664068   1038.68733836     -1.00000000 )   // 30
    (  -179.34574855   1028.95789765     -1.00000000 )   // 31
    (  -279.66310493   1016.55677899     -1.00000000 )   // 32
    (  -387.84192663    999.40343980     -1.00000000 )   // 33
    (  -498.25072551    977.52149305     -1.00000000 )   // 34
    (  -630.96398508    943.83999229     -1.00000000 )   // 35
    (  -835.75100435    867.75729757     -1.00000000 )   // 36
    (  -965.46069310    795.03609045     -1.00000000 )   // 37
    ( -1408.06764400    -73.79369830     -1.00000000 )   // 38
    (  -877.06789763   -891.59892215     -1.00000000 )   // 39
    (  -740.46733610   -950.36340045     -1.00000000 )   // 40
    (  -658.73394900   -975.66998807     -1.00000000 )   // 41
    (  -617.91718620   -986.08824557     -1.00000000 )   // 42
    (  -563.09114871   -998.10095723     -1.00000000 )   // 43
    (  -530.49392440  -1004.32166985     -1.00000000 )   // 44
    (    -4.23219420     80.75507609      1.00000000 )   // 45
    (   -76.17544389     74.51780616      1.00000000 )   // 46
    (  -147.84290003     65.65014131      1.00000000 )   // 47
    (  -219.16534649     54.33825088      1.00000000 )   // 48
    (  -290.01551634     40.37790871      1.00000000 )   // 49
    (  -360.06307735     22.85535714      1.00000000 )   // 50
    (  -428.01579169     -1.35258982      1.00000000 )   // 51
    (  -438.94858446     -7.69985584      1.00000000 )   // 52
    (  -449.38329064    -23.55118031      1.00000000 )   // 53
    (  -437.34883229    -38.22494576      1.00000000 )   // 54
    (  -425.81246053    -43.39465277      1.00000000 )   // 55
    (  -409.00472571    -48.72052072      1.00000000 )   // 56
    (  -391.91447672    -53.07014536      1.00000000 )   // 57
    (  -374.67204474    -56.77304345      1.00000000 )   // 58
    (  -357.34614880    -60.06542931      1.00000000 )   // 59
    (   -35.71941744    559.72120723      1.00000000 )   // 60
    (  -127.76059622    551.73785190      1.00000000 )   // 61
    (  -213.75300248    541.10346015      1.00000000 )   // 62
    (  -303.50363656    526.87084534      1.00000000 )   // 63
    (  -394.13312092    508.94970088      1.00000000 )   // 64
    (  -495.51353122    483.34767471      1.00000000 )   // 65
    (  -631.88339802    433.20235387      1.00000000 )   // 66
    (  -702.20463878    393.66811730      1.00000000 )   // 67
    (  -928.72546732    -48.67243931      1.00000000 )   // 68
    (  -657.20836496   -464.91193396      1.00000000 )   // 69
    (  -583.13989831   -496.87902661      1.00000000 )   // 70
    (  -533.86933735   -512.19525440      1.00000000 )   // 71
    (  -504.91583146   -519.57919546      1.00000000 )   // 72
    (  -468.88159672   -527.43700034      1.00000000 )   // 73
    (  -443.92003660   -532.19354958      1.00000000 )   // 74
    (   -67.20664068   1038.68733836      1.00000000 )   // 75
    (  -179.34574855   1028.95789765      1.00000000 )   // 76
    (  -279.66310493   1016.55677899      1.00000000 )   // 77
    (  -387.84192663    999.40343980      1.00000000 )   // 78
    (  -498.25072551    977.52149305      1.00000000 )   // 79
    (  -630.96398508    943.83999229      1.00000000 )   // 80
    (  -835.75100435    867.75729757      1.00000000 )   // 81
    (  -965.46069310    795.03609045      1.00000000 )   // 82
    ( -1408.06764400    -73.79369830      1.00000000 )   // 83
    (  -877.06789763   -891.59892215      1.00000000 )   // 84
    (  -740.46733610   -950.36340045      1.00000000 )   // 85
    (  -658.73394900   -975.66998807      1.00000000 )   // 86
    (  -617.91718620   -986.08824557      1.00000000 )   // 87
    (  -563.09114871   -998.10095723      1.00000000 )   // 88
    (  -530.49392440  -1004.32166985      1.00000000 )   // 89
);

blocks
(
    hex (45 46 61 60 0 1 16 15)  (47 240 2) simpleGrading (1 18 1)   // block 0
    hex (60 61 76 75 15 16 31 30)  (47 79 2) simpleGrading (1 1 1)   // block 1
    hex (46 47 62 61 1 2 17 16)  (47 240 2) simpleGrading (1 18 1)   // block 2
    hex (61 62 77 76 16 17 32 31)  (47 79 2) simpleGrading (1 1 1)   // block 3
    hex (47 48 63 62 2 3 18 17)  (47 240 2) simpleGrading (1 18 1)   // block 4
    hex (62 63 78 77 17 18 33 32)  (47 79 2) simpleGrading (1 1 1)   // block 5
    hex (48 49 64 63 3 4 19 18)  (47 240 2) simpleGrading (1 18 1)   // block 6
    hex (63 64 79 78 18 19 34 33)  (47 79 2) simpleGrading (1 1 1)   // block 7
    hex (49 50 65 64 4 5 20 19)  (47 240 2) simpleGrading (1 18 1)   // block 8
    hex (64 65 80 79 19 20 35 34)  (47 79 2) simpleGrading (1 1 1)   // block 9
    hex (50 51 66 65 5 6 21 20)  (47 240 2) simpleGrading (1 18 1)   // block 10
    hex (65 66 81 80 20 21 36 35)  (47 79 2) simpleGrading (1 1 1)   // block 11
    hex (51 52 67 66 6 7 22 21)  (10 240 2) simpleGrading (0.667197 18 1)   // block 12
    hex (66 67 82 81 21 22 37 36)  (10 79 2) simpleGrading (0.667197 1 1)   // block 13
    hex (52 53 68 67 7 8 23 22)  (56 240 2) simpleGrading (0.0634676 18 1)   // block 14
    hex (67 68 83 82 22 23 38 37)  (56 79 2) simpleGrading (0.0634676 1 1)   // block 15
    hex (53 54 69 68 8 9 24 23)  (51 240 2) simpleGrading (17.9281 18 1)   // block 16
    hex (68 69 84 83 23 24 39 38)  (51 79 2) simpleGrading (17.9281 1 1)   // block 17
    hex (54 55 70 69 9 10 25 24)  (13 240 2) simpleGrading (0.687031 18 1)   // block 18
    hex (69 70 85 84 24 25 40 39)  (13 79 2) simpleGrading (0.687031 1 1)   // block 19
    hex (55 56 71 70 10 11 26 25)  (22 240 2) simpleGrading (1 18 1)   // block 20
    hex (70 71 86 85 25 26 41 40)  (22 79 2) simpleGrading (1 1 1)   // block 21
    hex (56 57 72 71 11 12 27 26)  (22 240 2) simpleGrading (1 18 1)   // block 22
    hex (71 72 87 86 26 27 42 41)  (22 79 2) simpleGrading (1 1 1)   // block 23
    hex (57 58 73 72 12 13 28 27)  (22 240 2) simpleGrading (1 18 1)   // block 24
    hex (72 73 88 87 27 28 43 42)  (22 79 2) simpleGrading (1 1 1)   // block 25
    hex (58 59 74 73 13 14 29 28)  (22 240 2) simpleGrading (1 18 1)   // block 26
    hex (73 74 89 88 28 29 44 43)  (22 79 2) simpleGrading (1 1 1)   // block 27
);

edges
(
    spline 0 1 ( (   -25.92411539    79.19196647    -1.00000000 ) (   -47.54746175    77.35216658    -1.00000000 ) (   -69.05089791    75.28793473    -1.00000000 ) )
    spline 1 2 ( (   -90.39738987    72.98048338    -1.00000000 ) (  -111.53569645    70.48386836    -1.00000000 ) (  -132.40233877    67.79060166    -1.00000000 ) )
    spline 2 3 ( (  -152.96334446    64.94031554    -1.00000000 ) (  -173.17405781    61.94075774    -1.00000000 ) (  -192.97198909    58.80331432    -1.00000000 ) (  -212.32274200    55.55952867    -1.00000000 ) )
    spline 3 4 ( (  -231.18043617    52.19378057    -1.00000000 ) (  -249.50182895    48.74078074    -1.00000000 ) (  -267.23388930    45.22043189    -1.00000000 ) (  -284.34979553    41.63684339    -1.00000000 ) )
    spline 4 5 ( (  -300.80399696    37.98068639    -1.00000000 ) (  -316.56223864    34.28620058    -1.00000000 ) (  -331.57097137    30.56340223    -1.00000000 ) (  -345.82186694    26.82534511    -1.00000000 ) (  -359.26184718    23.09103314    -1.00000000 ) )
    spline 5 6 ( (  -371.86687708    19.38335561    -1.00000000 ) (  -383.60913817    15.72179510    -1.00000000 ) (  -394.46038804    12.11774534    -1.00000000 ) (  -404.39479797     8.57706612    -1.00000000 ) (  -413.39036982     5.10992267    -1.00000000 ) (  -421.42576489     1.73906293    -1.00000000 ) )
    spline 6 7 ( (  -428.48022497    -1.57047459    -1.00000000 ) (  -434.53813750    -4.80705685    -1.00000000 ) )
    spline 7 8 ( (  -439.57678127    -8.11188825    -1.00000000 ) (  -443.58145395   -11.52475384    -1.00000000 ) (  -446.54467515   -15.01642206    -1.00000000 ) (  -448.46340356   -18.52454831    -1.00000000 ) )
    spline 8 9 ( (  -447.94301668   -28.45412150    -1.00000000 ) (  -445.66810022   -31.74246814    -1.00000000 ) (  -442.35613314   -34.90526768    -1.00000000 ) (  -438.01665688   -37.88083496    -1.00000000 ) )
    spline 9 10 ( (  -432.66016638   -40.64088045    -1.00000000 ) (  -426.29712476   -43.22650809    -1.00000000 ) )
    spline 10 11 ( (  -418.93536888   -45.78052375    -1.00000000 ) (  -410.59164176   -48.29299006    -1.00000000 ) )
    spline 11 12 ( (  -401.28293342   -50.80084684    -1.00000000 ) )
    spline 12 13 ( (  -391.03284346   -53.28370125    -1.00000000 ) (  -379.86431209   -55.73374317    -1.00000000 ) )
    spline 13 14 ( (  -367.80363905   -58.14784476    -1.00000000 ) )
    spline 15 16 ( (   -63.52162044   557.71722977    -1.00000000 ) (   -90.82874275   555.39686189    -1.00000000 ) (  -117.77867353   552.80820014    -1.00000000 ) )
    spline 16 17 ( (  -144.34171969   549.93961085    -1.00000000 ) (  -170.40998790   546.85957913    -1.00000000 ) (  -196.08099945   543.54792233    -1.00000000 ) )
    spline 17 18 ( (  -221.15366026   540.07196133    -1.00000000 ) (  -245.97439590   536.38792105    -1.00000000 ) (  -270.21643077   532.54722851    -1.00000000 ) (  -294.17241239   528.52953983    -1.00000000 ) )
    spline 18 19 ( (  -317.80184273   524.31318488    -1.00000000 ) (  -340.68939533   519.99955015    -1.00000000 ) (  -363.15502124   515.53855450    -1.00000000 ) (  -385.59614500   510.83741534    -1.00000000 ) )
    spline 19 20 ( (  -407.64941574   505.93800975    -1.00000000 ) (  -429.12941781   500.90020612    -1.00000000 ) (  -450.24984919   495.66051463    -1.00000000 ) (  -470.97345193   490.22267006    -1.00000000 ) (  -491.24708365   484.58848422    -1.00000000 ) )
    spline 20 21 ( (  -511.04972130   478.76134363    -1.00000000 ) (  -530.71963576   472.62277070    -1.00000000 ) (  -550.70620497   465.97592219    -1.00000000 ) (  -571.31759563   458.61793051    -1.00000000 ) (  -592.59787595   450.40159084    -1.00000000 ) (  -616.31555927   440.39378825    -1.00000000 ) )
    spline 21 22 ( (  -643.70998865   427.47048946    -1.00000000 ) (  -679.94658269   407.71530015    -1.00000000 ) )
    spline 22 23 ( (  -728.45266083   375.22963860    -1.00000000 ) (  -785.33635149   325.52656274    -1.00000000 ) (  -845.78247980   251.45904649    -1.00000000 ) (  -910.00438295   113.30839271    -1.00000000 ) )
    spline 23 24 ( (  -893.17533156  -207.80903720    -1.00000000 ) (  -814.86456717  -338.48987039    -1.00000000 ) (  -747.00740543  -405.83329614    -1.00000000 ) (  -685.23994344  -449.31812858    -1.00000000 ) )
    spline 24 25 ( (  -633.60391039  -476.55556447    -1.00000000 ) (  -595.50084462  -492.41477729    -1.00000000 ) )
    spline 25 26 ( (  -566.90563223  -502.40378330    -1.00000000 ) (  -542.27177663  -509.87758911    -1.00000000 ) )
    spline 26 27 ( (  -520.24923056  -515.82452381    -1.00000000 ) )
    spline 27 28 ( (  -498.98163169  -520.98773065    -1.00000000 ) (  -478.40976614  -525.50900166    -1.00000000 ) )
    spline 28 29 ( (  -458.20594993  -529.55788091    -1.00000000 ) )
    spline 30 31 ( (  -101.11912548  1036.24249306    -1.00000000 ) (  -134.11002375  1033.44155720    -1.00000000 ) (  -166.50644915  1030.32846556    -1.00000000 ) )
    spline 31 32 ( (  -198.28604952  1026.89873832    -1.00000000 ) (  -229.28427936  1023.23528989    -1.00000000 ) (  -259.75966013  1019.30524300    -1.00000000 ) )
    spline 32 33 ( (  -289.34397605  1015.20360712    -1.00000000 ) (  -318.77473399  1010.83508437    -1.00000000 ) (  -347.46087245  1006.29114270    -1.00000000 ) (  -376.02208278  1001.49955099    -1.00000000 ) )
    spline 33 34 ( (  -404.42324930   996.43258919    -1.00000000 ) (  -431.87696171   991.25831955    -1.00000000 ) (  -459.07615318   985.85667710    -1.00000000 ) (  -486.84249447   980.03798729    -1.00000000 ) )
    spline 34 35 ( (  -514.49483452   973.89533311    -1.00000000 ) (  -541.69659699   967.51421167    -1.00000000 ) (  -568.92872701   960.75762703    -1.00000000 ) (  -596.12503693   953.61999501    -1.00000000 ) (  -623.23232013   946.08593530    -1.00000000 ) )
    spline 35 36 ( (  -650.23256552   938.13933164    -1.00000000 ) (  -677.83013334   929.52374630    -1.00000000 ) (  -706.95202189   919.83409904    -1.00000000 ) (  -738.24039328   908.65879490    -1.00000000 ) (  -771.80538207   895.69325902    -1.00000000 ) (  -811.20535366   879.04851357    -1.00000000 ) )
    spline 36 37 ( (  -858.93975232   856.51145350    -1.00000000 ) (  -925.35502788   820.23765716    -1.00000000 ) )
    spline 37 38 ( ( -1017.32854038   758.57116546    -1.00000000 ) ( -1127.09124903   662.57787932    -1.00000000 ) ( -1245.02028444   517.93451504    -1.00000000 ) ( -1371.54536235   245.14133374    -1.00000000 ) )
    spline 38 39 ( ( -1338.40764644  -387.16395290    -1.00000000 ) ( -1184.06103413  -645.23727265    -1.00000000 ) ( -1051.65867772  -776.76132459    -1.00000000 ) (  -932.46322999  -860.75542221    -1.00000000 ) )
    spline 39 40 ( (  -834.54765440  -912.47024849    -1.00000000 ) (  -764.70456448  -941.60304649    -1.00000000 ) )
    spline 40 41 ( (  -714.87589559  -959.02704285    -1.00000000 ) (  -673.95191151  -971.46218816    -1.00000000 ) )
    spline 41 42 ( (  -639.21552770  -980.84820078    -1.00000000 ) )
    spline 42 43 ( (  -606.93041991  -988.69176005    -1.00000000 ) (  -576.95522018  -995.28426015    -1.00000000 ) )
    spline 43 44 ( (  -548.60826082 -1000.96791707    -1.00000000 ) )
    spline 45 46 ( (   -25.92411539    79.19196647     1.00000000 ) (   -47.54746175    77.35216658     1.00000000 ) (   -69.05089791    75.28793473     1.00000000 ) )
    spline 46 47 ( (   -90.39738987    72.98048338     1.00000000 ) (  -111.53569645    70.48386836     1.00000000 ) (  -132.40233877    67.79060166     1.00000000 ) )
    spline 47 48 ( (  -152.96334446    64.94031554     1.00000000 ) (  -173.17405781    61.94075774     1.00000000 ) (  -192.97198909    58.80331432     1.00000000 ) (  -212.32274200    55.55952867     1.00000000 ) )
    spline 48 49 ( (  -231.18043617    52.19378057     1.00000000 ) (  -249.50182895    48.74078074     1.00000000 ) (  -267.23388930    45.22043189     1.00000000 ) (  -284.34979553    41.63684339     1.00000000 ) )
    spline 49 50 ( (  -300.80399696    37.98068639     1.00000000 ) (  -316.56223864    34.28620058     1.00000000 ) (  -331.57097137    30.56340223     1.00000000 ) (  -345.82186694    26.82534511     1.00000000 ) (  -359.26184718    23.09103314     1.00000000 ) )
    spline 50 51 ( (  -371.86687708    19.38335561     1.00000000 ) (  -383.60913817    15.72179510     1.00000000 ) (  -394.46038804    12.11774534     1.00000000 ) (  -404.39479797     8.57706612     1.00000000 ) (  -413.39036982     5.10992267     1.00000000 ) (  -421.42576489     1.73906293     1.00000000 ) )
    spline 51 52 ( (  -428.48022497    -1.57047459     1.00000000 ) (  -434.53813750    -4.80705685     1.00000000 ) )
    spline 52 53 ( (  -439.57678127    -8.11188825     1.00000000 ) (  -443.58145395   -11.52475384     1.00000000 ) (  -446.54467515   -15.01642206     1.00000000 ) (  -448.46340356   -18.52454831     1.00000000 ) )
    spline 53 54 ( (  -447.94301668   -28.45412150     1.00000000 ) (  -445.66810022   -31.74246814     1.00000000 ) (  -442.35613314   -34.90526768     1.00000000 ) (  -438.01665688   -37.88083496     1.00000000 ) )
    spline 54 55 ( (  -432.66016638   -40.64088045     1.00000000 ) (  -426.29712476   -43.22650809     1.00000000 ) )
    spline 55 56 ( (  -418.93536888   -45.78052375     1.00000000 ) (  -410.59164176   -48.29299006     1.00000000 ) )
    spline 56 57 ( (  -401.28293342   -50.80084684     1.00000000 ) )
    spline 57 58 ( (  -391.03284346   -53.28370125     1.00000000 ) (  -379.86431209   -55.73374317     1.00000000 ) )
    spline 58 59 ( (  -367.80363905   -58.14784476     1.00000000 ) )
    spline 60 61 ( (   -63.52162044   557.71722977     1.00000000 ) (   -90.82874275   555.39686189     1.00000000 ) (  -117.77867353   552.80820014     1.00000000 ) )
    spline 61 62 ( (  -144.34171969   549.93961085     1.00000000 ) (  -170.40998790   546.85957913     1.00000000 ) (  -196.08099945   543.54792233     1.00000000 ) )
    spline 62 63 ( (  -221.15366026   540.07196133     1.00000000 ) (  -245.97439590   536.38792105     1.00000000 ) (  -270.21643077   532.54722851     1.00000000 ) (  -294.17241239   528.52953983     1.00000000 ) )
    spline 63 64 ( (  -317.80184273   524.31318488     1.00000000 ) (  -340.68939533   519.99955015     1.00000000 ) (  -363.15502124   515.53855450     1.00000000 ) (  -385.59614500   510.83741534     1.00000000 ) )
    spline 64 65 ( (  -407.64941574   505.93800975     1.00000000 ) (  -429.12941781   500.90020612     1.00000000 ) (  -450.24984919   495.66051463     1.00000000 ) (  -470.97345193   490.22267006     1.00000000 ) (  -491.24708365   484.58848422     1.00000000 ) )
    spline 65 66 ( (  -511.04972130   478.76134363     1.00000000 ) (  -530.71963576   472.62277070     1.00000000 ) (  -550.70620497   465.97592219     1.00000000 ) (  -571.31759563   458.61793051     1.00000000 ) (  -592.59787595   450.40159084     1.00000000 ) (  -616.31555927   440.39378825     1.00000000 ) )
    spline 66 67 ( (  -643.70998865   427.47048946     1.00000000 ) (  -679.94658269   407.71530015     1.00000000 ) )
    spline 67 68 ( (  -728.45266083   375.22963860     1.00000000 ) (  -785.33635149   325.52656274     1.00000000 ) (  -845.78247980   251.45904649     1.00000000 ) (  -910.00438295   113.30839271     1.00000000 ) )
    spline 68 69 ( (  -893.17533156  -207.80903720     1.00000000 ) (  -814.86456717  -338.48987039     1.00000000 ) (  -747.00740543  -405.83329614     1.00000000 ) (  -685.23994344  -449.31812858     1.00000000 ) )
    spline 69 70 ( (  -633.60391039  -476.55556447     1.00000000 ) (  -595.50084462  -492.41477729     1.00000000 ) )
    spline 70 71 ( (  -566.90563223  -502.40378330     1.00000000 ) (  -542.27177663  -509.87758911     1.00000000 ) )
    spline 71 72 ( (  -520.24923056  -515.82452381     1.00000000 ) )
    spline 72 73 ( (  -498.98163169  -520.98773065     1.00000000 ) (  -478.40976614  -525.50900166     1.00000000 ) )
    spline 73 74 ( (  -458.20594993  -529.55788091     1.00000000 ) )
    spline 75 76 ( (  -101.11912548  1036.24249306     1.00000000 ) (  -134.11002375  1033.44155720     1.00000000 ) (  -166.50644915  1030.32846556     1.00000000 ) )
    spline 76 77 ( (  -198.28604952  1026.89873832     1.00000000 ) (  -229.28427936  1023.23528989     1.00000000 ) (  -259.75966013  1019.30524300     1.00000000 ) )
    spline 77 78 ( (  -289.34397605  1015.20360712     1.00000000 ) (  -318.77473399  1010.83508437     1.00000000 ) (  -347.46087245  1006.29114270     1.00000000 ) (  -376.02208278  1001.49955099     1.00000000 ) )
    spline 78 79 ( (  -404.42324930   996.43258919     1.00000000 ) (  -431.87696171   991.25831955     1.00000000 ) (  -459.07615318   985.85667710     1.00000000 ) (  -486.84249447   980.03798729     1.00000000 ) )
    spline 79 80 ( (  -514.49483452   973.89533311     1.00000000 ) (  -541.69659699   967.51421167     1.00000000 ) (  -568.92872701   960.75762703     1.00000000 ) (  -596.12503693   953.61999501     1.00000000 ) (  -623.23232013   946.08593530     1.00000000 ) )
    spline 80 81 ( (  -650.23256552   938.13933164     1.00000000 ) (  -677.83013334   929.52374630     1.00000000 ) (  -706.95202189   919.83409904     1.00000000 ) (  -738.24039328   908.65879490     1.00000000 ) (  -771.80538207   895.69325902     1.00000000 ) (  -811.20535366   879.04851357     1.00000000 ) )
    spline 81 82 ( (  -858.93975232   856.51145350     1.00000000 ) (  -925.35502788   820.23765716     1.00000000 ) )
    spline 82 83 ( ( -1017.32854038   758.57116546     1.00000000 ) ( -1127.09124903   662.57787932     1.00000000 ) ( -1245.02028444   517.93451504     1.00000000 ) ( -1371.54536235   245.14133374     1.00000000 ) )
    spline 83 84 ( ( -1338.40764644  -387.16395290     1.00000000 ) ( -1184.06103413  -645.23727265     1.00000000 ) ( -1051.65867772  -776.76132459     1.00000000 ) (  -932.46322999  -860.75542221     1.00000000 ) )
    spline 84 85 ( (  -834.54765440  -912.47024849     1.00000000 ) (  -764.70456448  -941.60304649     1.00000000 ) )
    spline 85 86 ( (  -714.87589559  -959.02704285     1.00000000 ) (  -673.95191151  -971.46218816     1.00000000 ) )
    spline 86 87 ( (  -639.21552770  -980.84820078     1.00000000 ) )
    spline 87 88 ( (  -606.93041991  -988.69176005     1.00000000 ) (  -576.95522018  -995.28426015     1.00000000 ) )
    spline 88 89 ( (  -548.60826082 -1000.96791707     1.00000000 ) )
);

boundary
(
    airfoil
    {
        type wall;
        faces
        (
            (0 45 46 1)
            (1 46 47 2)
            (2 47 48 3)
            (3 48 49 4)
            (4 49 50 5)
            (5 50 51 6)
            (6 51 52 7)
            (7 52 53 8)
            (8 53 54 9)
            (9 54 55 10)
            (10 55 56 11)
            (11 56 57 12)
            (12 57 58 13)
            (13 58 59 14)
        );
    }

    farfield
    {
        type patch;
        faces
        (
            (30 31 76 75)
            (31 32 77 76)
            (32 33 78 77)
            (33 34 79 78)
            (34 35 80 79)
            (35 36 81 80)
            (36 37 82 81)
            (37 38 83 82)
            (38 39 84 83)
            (39 40 85 84)
            (40 41 86 85)
            (41 42 87 86)
            (42 43 88 87)
            (43 44 89 88)
        );
    }

    suctionOutlet
    {
        type patch;
        faces
        (
            (0 15 60 45)
            (15 30 75 60)
        );
    }

    pressureOutlet
    {
        type patch;
        faces
        (
            (14 29 74 59)
            (29 44 89 74)
        );
    }

    front
    {
        type empty;
        faces
        (
            (0 1 16 15)
            (15 16 31 30)
            (1 2 17 16)
            (16 17 32 31)
            (2 3 18 17)
            (17 18 33 32)
            (3 4 19 18)
            (18 19 34 33)
            (4 5 20 19)
            (19 20 35 34)
            (5 6 21 20)
            (20 21 36 35)
            (6 7 22 21)
            (21 22 37 36)
            (7 8 23 22)
            (22 23 38 37)
            (8 9 24 23)
            (23 24 39 38)
            (9 10 25 24)
            (24 25 40 39)
            (10 11 26 25)
            (25 26 41 40)
            (11 12 27 26)
            (26 27 42 41)
            (12 13 28 27)
            (27 28 43 42)
            (13 14 29 28)
            (28 29 44 43)
        );
    }

    back
    {
        type empty;
        faces
        (
            (45 46 61 60)
            (60 61 76 75)
            (46 47 62 61)
            (61 62 77 76)
            (47 48 63 62)
            (62 63 78 77)
            (48 49 64 63)
            (63 64 79 78)
            (49 50 65 64)
            (64 65 80 79)
            (50 51 66 65)
            (65 66 81 80)
            (51 52 67 66)
            (66 67 82 81)
            (52 53 68 67)
            (67 68 83 82)
            (53 54 69 68)
            (68 69 84 83)
            (54 55 70 69)
            (69 70 85 84)
            (55 56 71 70)
            (70 71 86 85)
            (56 57 72 71)
            (71 72 87 86)
            (57 58 73 72)
            (72 73 88 87)
            (58 59 74 73)
            (73 74 89 88)
        );
    }

);

mergePatchPairs
(
);

// ********************************************************** //
