PreProcessing/Modules/BaseFlowGenerator/TunnelToCurvedPlateModule/AirfoilLECase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{ 
    solverInfo
    {
        type  solverInfo;
        libs  ("libutilityFunctionObjects.so");
        writeControl  timeStep;   // write every SIMPLE iteration
        writeInterval 1;

        fields (U p);             // track these fields' residuals
    }

    //wallShearStress
    //{
    //type                 wallShearStress;
    //libs                 ("libfieldFunctionObjects.so");
    //executeControl       writeTime;
    //writeControl         writeTime;
    //}

    //wallPressure
    //{
    //type                 surfaces;
    //functionObjectLibs   ("libsampling.so");
    //outputControl        outputTime;
    //surfaceFormat        foam;
    //interpolationScheme  cell;

    //fields (p);
    //surfaces
    //(
    // flatPlate
    //{
    // type patch;
    // patches (flatPlate);
    // interpolate true;
    // triangulate false;
    //}
    // upperWall
    //{
    // type patch;
    // patches (upperWall);
    // interpolate true;
    // triangulate false;
    //}
    //);
    //} 
}

// ************************************************************************* //
