PreProcessing/Modules/BaseFlowGenerator/TunnelToCurvedPlateModule/AirfoilLECase/system/inputDomain
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          inputDomain;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilCharacteristics
{
    chord           900;        // physical chord [mm]
    alphaDeg        -3.0;       // angle of attack [deg]
    xAirfoilCenter  0.0;        // global x of mid-chord pivot [mm]
    yAirfoilCenter  0.0;        // global y of mid-chord pivot [mm]
}

domainSize
{
    // Grid extent along the chord (dimensionless, x/c)
    xiArch              0.025;  // x/c separating arch from straight sections
    xiSuctionOutlet     0.50;   // suction (upper) outlet position
    xiPressureOutlet    0.10;   // pressure (lower) outlet position

    // Wall-normal (radial) band heights [mm]
    hBL                 480;    // boundary-layer band height along normal
    hFar                480;    // far-field band height along normal

    // Spanwise extent [mm]
    zWidth              2;

    // Number of segments (blocks) along the C-path in each section
    nSegSuction         6;      // suction outlet  → xiArch  (upper)
    nSegArchUp          2;      // xiArch          → LE      (upper)
    nSegArchLo          2;      // LE              → xiArch  (lower)
    nSegPressure        4;      // xiArch          → pressure outlet (lower)

    // Station distribution
    cosineArch          true;   // cosine clustering in the arch region
}

gridResolution
{
    // Total streamwise cells (distributed proportional to arc length)
    nxTotal             500;

    // Cells in the wall-normal direction
    nyBL                240;     // cells in boundary-layer blocks
    // nyFar is auto-computed to match the BL outer cell size

    // Cells in the spanwise direction
    nz                  2;

    // Cell grading
    gradBL              18.0;   // BL blocks: expansion toward the wall
    // gradFar is auto-computed (uniform) to match at BL-farfield interface
    gradArch            18.0;    // arch: boundary cell / LE cell (clusters toward LE)
}

// *********************************************************************** //
