PreProcessing/Modules/BaseFlowGenerator/TunnelToCurvedPlateModule/AirfoilLECase/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "humpCoeffs"

actions
(
    // -------- 1) Global box: full y (wall → yTop), FWHM (or k*sig) in x --------
    {
        name    humpGlobalBoxCells;
        type    cellSet;
        action  new;

        source  boxToCell;
        sourceInfo
        {
            box
            #codeStream
            {
                code
                #{
                    using namespace Foam;

                    const dictionary& bc = dict.subDict("humpCoeffs");

                    // Geometry (all in mm; converted to m at the end)
                    const scalar xC    = readScalar(bc.lookup("xC"));
                    const scalar sig   = readScalar(bc.lookup("sig"));
                    const scalar yTop  = bc.lookupOrDefault<scalar>("yTop",  20.0);
                    const scalar zBack = bc.lookupOrDefault<scalar>("zBack", 0.1);

                    // Span controls
                    const bool   useFWHM = bc.lookupOrDefault<bool>("useFWHM", true);
                    const scalar kSigma  = bc.lookupOrDefault<scalar>("kSigma", 2.0);
                    const scalar padX    = bc.lookupOrDefault<scalar>("padX",   0.0);
                    const scalar padY    = bc.lookupOrDefault<scalar>("padY",   0.0);
                    const scalar padZ    = bc.lookupOrDefault<scalar>("padZ",   0.0);

                    // Safety: avoid degenerate width if sig≈0
                    const scalar minHalfSpan = bc.lookupOrDefault<scalar>("minXHalfSpan", 1.0); // mm

                    scalar halfW = useFWHM ? 0.5*2.354820045*sig : kSigma*sig;
                    halfW = max(halfW, minHalfSpan);

                    // Box (mm)
                    const scalar xMin_mm = xC - halfW - padX;
                    const scalar xMax_mm = xC + halfW + padX;
                    const scalar yMin_mm = -padY;               // from wall upward
                    const scalar yMax_mm = yTop + padY;         // to top
                    const scalar zMin_mm = 0.0 - padZ;
                    const scalar zMax_mm = zBack + padZ;

                    // Convert to meters (mesh uses scale 0.001)
                    auto mm2m = [](scalar v){ return v*1e-3; };

                    os  << "(" << mm2m(xMin_mm) << " " << mm2m(yMin_mm) << " " << mm2m(zMin_mm) << ") "
                        << "(" << mm2m(xMax_mm) << " " << mm2m(yMax_mm) << " " << mm2m(zMax_mm) << ")";
                #};
            };
        }
    }

    // -------- 2) Local/tall box: same x, height = max(4|A|, minTallHeight) --------
    {
        name    humpLocalBoxCells;
        type    cellSet;
        action  new;

        source  boxToCell;
        sourceInfo
        {
            box
            #codeStream
            {
                code
                #{
                    using namespace Foam;

                    const dictionary& bc = dict.subDict("humpCoeffs");

                    // Geometry (mm)
                    const scalar A     = readScalar(bc.lookup("A"));
                    const scalar xC    = readScalar(bc.lookup("xC"));
                    const scalar sig   = readScalar(bc.lookup("sig"));
                    const scalar yTop  = bc.lookupOrDefault<scalar>("yTop",  20.0);
                    const scalar zBack = bc.lookupOrDefault<scalar>("zBack", 0.1);

                    // Span controls
                    const bool   useFWHM = bc.lookupOrDefault<bool>("useFWHM", true);
                    const scalar kSigma  = bc.lookupOrDefault<scalar>("kSigma", 2.0);
                    const scalar padX    = bc.lookupOrDefault<scalar>("padX",   0.0);
                    const scalar padY    = bc.lookupOrDefault<scalar>("padY",   0.0);
                    const scalar padZ    = bc.lookupOrDefault<scalar>("padZ",   0.0);

                    // Safeties
                    const scalar minHalfSpan = bc.lookupOrDefault<scalar>("minXHalfSpan", 1.0); // mm
                    const scalar minTallH    = bc.lookupOrDefault<scalar>("minTallHeight", 1.0); // mm
                    const bool   clampToTop  = bc.lookupOrDefault<bool>("clampToTop", true);

                    // x half-span (mm)
                    scalar halfW = useFWHM ? 0.5*2.354820045*sig : kSigma*sig;
                    halfW = max(halfW, minHalfSpan);

                    // x-span (mm)
                    const scalar xMin_mm = xC - halfW - padX;
                    const scalar xMax_mm = xC + halfW + padX;

                    // y height target (mm): 6*|A| with minimum fallback
                    scalar H4_mm = 6.0*mag(A);
                    H4_mm = max(H4_mm, minTallH);

                    // y-span (mm): from wall to H4 (optionally clamped to top)
                    scalar yMin_mm = -padY;
                    scalar yMax_mm = H4_mm + padY;
                    if (clampToTop) yMax_mm = min(yMax_mm, yTop + padY);

                    // z-span (mm)
                    const scalar zMin_mm = 0.0 - padZ;
                    const scalar zMax_mm = zBack + padZ;

                    // Convert to meters
                    auto mm2m = [](scalar v){ return v*1e-3; };

                    os  << "(" << mm2m(xMin_mm) << " " << mm2m(yMin_mm) << " " << mm2m(zMin_mm) << ") "
                        << "(" << mm2m(xMax_mm) << " " << mm2m(yMax_mm) << " " << mm2m(zMax_mm) << ")";
                #};
            };
        }
    }
);

// *********************************************************************** //
